{
    "education": [
        {
            "description": "Promising Artist Achievement Award, William Dole Award, Faculty Award of Distinction x2, Dean's Honors x5",
            "location": "Santa Barbara, CA",
            "organization": "University of California",
            "time": "Graduated 2014",
            "title": "BA in Art with High Honors"
        },
        {
            "description": "Dean's List x3, Hope Scholar",
            "location": "Athens, GA",
            "organization": "University of Georgia",
            "title": "Cognitive Science"
        }
    ],
    "professionalDevelopment": [
        {
            "organization": "MongoDB University",
            "time": "Completed 2015",
            "title": "MongoDB for Node.js Developers"
        },
        {
            "organization": "Udacity",
            "time": "Completed 2015",
            "title": "Front-End Web Developer Nanodegree"
        }
    ],
    "volunteering": [
        {
            "location": "Pasadena, CA",
            "organization": "Arroyo Food Co-op",
            "time": "Feb 2016 - May 2016",
            "title": "Shopify Administrator"
        },
        {
            "location": "Goleta, CA",
            "organization": "Food Not Bombs",
            "time": "Jan 2013 - Sep 2014"
        }
    ],
    "work": [
        {
            "bullets": [
                "Designed and developed analytics pipeline with AWS and Snowflake, 95% under monthly budget",
                "Optimized and refactored Node cron jobs for concurrency, 90-99% reduction in runtimes",
                "Completed insights dashboard with React charts and new data sources",
                "Maintained monolith full-stack app with React, Redux, RxJS, Node, Sails, MongoDB, Redis, NGINX",
                "Implemented UI/UX redesigns, animations, and responsiveness with HTML5, CSS3, SCSS/SASS, and SVG",
                "Led development of mobile app for brand users with React-Native, React Query, and TypeScript"
            ],
            "location": "Culver City, CA",
            "organization": "Snail Games USA, Eminence Corp DBA",
            "time": "Jan 2021 - Feb 2023",
            "title": "Senior Software Engineer"
        },
        {
            "bullets": [
                "Helped architect/develop new serverless platform with AWS, for > 90% reduction in monthly costs",
                "Designed and developed streaming video based LMS and CMS with React, Redux, and AWS",
                "Automated video CC creation with AWS Transcribe, Translate, and WebVTT, cutting > 95% of labor",
                "Developed custom HLS video player with React and HTML5 for better app integration",
                "Developed interactive floor plan viewers for web and mobile with SVG, React, and React-Native",
                "Designed and developed First Responder mobile app with React-Native and AWS Serverless",
                "Finished mobile app started by another team with Swift, Ruby, Rails, Redis, Sidekiq, ElasticSearch"
            ],
            "location": "Pasadena, CA",
            "organization": "Building Safety Solutions, Inc",
            "time": "Mar 2018 - Jul 2020",
            "title": "Technology Consultant"
        },
        {
            "bullets": [
                "Maintained legacy monolith application with Ruby, Rails, and MSSQL",
                "Developed several mobile apps with React-Native for ad-hoc deployment to high rise buildings",
                "Modernized existing front-end video/quiz courseware with React/Redux, helping win contracts with Paramount, Brookfield, and Metro",
                "Developed standalone LAWA training program with React, Node, and GCP"
            ],
            "location": "Pasadena, CA",
            "organization": "Building Safety Solutions, Inc",
            "time": "Feb 2017 - Jan 2018",
            "title": "Junior Front-end Developer"
        },
        {
            "description": "Developed a third-party JavaScript lead gen app. Wrote back-end integrations for marketing services like ActiveCampaign. Wrote scripts to clean redundancies and errors from a large database, built a web directory service to navigate the data, then incorporated user profiles, a membership service, and InfusionSoft for payment processing.",
            "location": "Los Angeles, CA",
            "organization": "Advercalls, Inc",
            "time": "Feb 2016 - Jul 2016",
            "title": "Web Engineer"
        },
        {
            "description": "Converted PSD designs to pixel perfect UI with Enyo.js for an enterprise Cisco IoT project.",
            "location": "Burbank, CA",
            "organization": "Not That This, LLC",
            "time": "Nov 2015 - Jan 2016",
            "title": "Contract Software Developer"
        },
        {
            "description": "Evaluated the relevancy of Microsoft Bing search results.",
            "location": "Redmond, WA",
            "organization": "FlexaSoft",
            "time": "Oct 2014 - Jun 2015",
            "title": "Web Content Evaluator"
        },
        {
            "description": "Worked on a new website for the UCIRA. Merged their main site and State of the Arts blog. Worked to create a platform for California art researchers to network and display their work. The project was cancelled after funding cuts.",
            "location": "Santa Barbara, CA",
            "organization": "University of California Institute for Research in the Arts",
            "time": "Jul 2014 - Sep 2014",
            "title": "Web Developer"
        },
        {
            "description": "Provided technical assistance and support related to computer networks, hardware, and software. Responded to calls and emails and tracked issues with JIRA to help diagnose, solve, and document problems. Managed hardware inventory.",
            "location": "Santa Barbara, CA",
            "organization": "Davidson Library",
            "time": "Mar 2013 - Jul 2014",
            "title": "IT Helpdesk Assistant"
        }
    ]
}